Soap/operation/SWIFT/SWIFT_Samples/import_SWIFT_Full.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_OPERATION xmlns="urn:amlyze-services:EvaluateOperationService_v2r0">
            <CommunicationNumber>Com_9912</CommunicationNumber>
            <Requester>Financial_institution</Requester>
            <OperationType>SWIFT</OperationType>
            <RiskManagementCategory>OP_DEFAULT</RiskManagementCategory>
            <SourceOfRiskLevel>IMPORT</SourceOfRiskLevel>
            <OperationStatus>EXECUTED</OperationStatus>
            <RiskLevel>LOW</RiskLevel>
            <OperationExtId>Op_009912</OperationExtId>
            <InitializeScreeningProcesses>
                <Process>SANCTIONS</Process>
                <Process>ADVERSE_MEDIA</Process>
                <Process>PEP</Process>
            </InitializeScreeningProcesses>
            <FinancialFlowDirection>INCOMING</FinancialFlowDirection>
            <OperationDateTime>2023-01-08T09:09:33+02:00</OperationDateTime>
            <Currency>EUR</Currency>
            <Amount>555.99</Amount>
            <SourceCountry>LT</SourceCountry>
            <DestinationCountry>LT</DestinationCountry>
            <Description>Agreement Nr 1001, 2022-10-01</Description>
            <IPAddress>555.222.757.222</IPAddress>
            <IPAddressCountry>LT</IPAddressCountry>
            <ListOperationParty>
                <OperationParty>
                    <PartyRole>DEBTOR</PartyRole>
                    <AccountNumber>LV11245541148212335</AccountNumber>
                    <Currency>EUR</Currency>
                    <BIC>BIC22XX</BIC>
                    <BankTitle>Finland Bank</BankTitle>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Antonio</FirstName>
                    <LastName>Murara</LastName>
                </OperationParty>
                <OperationParty>
                    <PartyRole>CREDITOR</PartyRole>
                    <AccountNumber>LT5630800200000011112</AccountNumber>
                    <Currency>EUR</Currency>
                    <BIC>BIC22XX</BIC>
                    <BankTitle>TBC</BankTitle>
                    <EntityType>ORGANIZATION</EntityType>
                    <Title>Komapnele</Title>
                </OperationParty>
            </ListOperationParty>
        </AMLYZE_OPERATION>
    </soap:Body>
</soap:Envelope>